Before merge, verify that all the following plans are correct. They will be applied as-is after the merge.

#### Terraform plans
<details><summary>libp2p</summary>

```

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # github_repository.this["js-libp2p-simple-metrics"] will be created
  + resource "github_repository" "this" {
      + allow_auto_merge            = false
      + allow_merge_commit          = true
      + allow_rebase_merge          = true
      + allow_squash_merge          = true
      + allow_update_branch         = true
      + archived                    = false
      + default_branch              = "main"
      + delete_branch_on_merge      = false
      + description                 = "Simple in-memory metrics gathering for libp2p"
      + etag                        = (known after apply)
      + full_name                   = (known after apply)
      + git_clone_url               = (known after apply)
      + has_discussions             = false
      + html_url                    = (known after apply)
      + http_clone_url              = (known after apply)
      + id                          = (known after apply)
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
      + name                        = "js-libp2p-simple-metrics"
      + node_id                     = (known after apply)
      + private                     = (known after apply)
      + repo_id                     = (known after apply)
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
      + ssh_clone_url               = (known after apply)
      + svn_url                     = (known after apply)
      + visibility                  = "public"

      + security_and_analysis {

          + secret_scanning {
              + status = "enabled"
            }

          + secret_scanning_push_protection {
              + status = "enabled"
            }
        }
    }

  # github_repository_collaborator.this["js-libp2p-simple-metrics:web3-bot"] will be created
  + resource "github_repository_collaborator" "this" {
      + id                          = (known after apply)
      + invitation_id               = (known after apply)
      + permission                  = "push"
      + permission_diff_suppression = false
      + repository                  = "js-libp2p-simple-metrics"
      + username                    = "web3-bot"
    }

  # github_repository_file.this["go-libdht/.github/workflows/stale.yml"] will be updated in-place
  ~ resource "github_repository_file" "this" {
      + commit_author       = "GitHub"
      + commit_email        = "noreply@github.com"
        id                  = "go-libdht/.github/workflows/stale.yml"
        # (9 unchanged attributes hidden)
    }

  # github_repository_file.this["js-libp2p-simple-metrics/.github/workflows/semantic-pull-request.yml"] will be created
  + resource "github_repository_file" "this" {
      + branch              = "main"
      + commit_author       = "GitHub"
      + commit_email        = "noreply@github.com"
      + commit_message      = "chore: Update .github/workflows/semantic-pull-request.yml [skip ci]"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            name: Semantic PR
            
            on:
              pull_request_target:
                types:
                  - opened
                  - edited
                  - synchronize
            
            jobs:
              main:
                uses: pl-strflt/.github/.github/workflows/reusable-semantic-pull-request.yml@v0.3
        EOT
      + file                = ".github/workflows/semantic-pull-request.yml"
      + id                  = (known after apply)
      + overwrite_on_create = false
      + ref                 = (known after apply)
      + repository          = "js-libp2p-simple-metrics"
      + sha                 = (known after apply)
    }

  # github_repository_file.this["js-libp2p-simple-metrics/.github/workflows/stale.yml"] will be created
  + resource "github_repository_file" "this" {
      + branch              = "main"
      + commit_author       = "GitHub"
      + commit_email        = "noreply@github.com"
      + commit_message      = "chore: Update .github/workflows/stale.yml [skip ci]"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            name: Close and mark stale issue
            
            on:
              schedule:
                - cron: '0 0 * * *'
            
            permissions:
              issues: write
              pull-requests: write
            
            jobs:
              stale:
                uses: pl-strflt/.github/.github/workflows/reusable-stale-issue.yml@v0.3
        EOT
      + file                = ".github/workflows/stale.yml"
      + id                  = (known after apply)
      + overwrite_on_create = false
      + ref                 = (known after apply)
      + repository          = "js-libp2p-simple-metrics"
      + sha                 = (known after apply)
    }

  # github_repository_file.this["js-libp2p-simple-metrics/codeowners"] will be created
  + resource "github_repository_file" "this" {
      + branch              = "main"
      + commit_author       = "GitHub"
      + commit_email        = "noreply@github.com"
      + commit_message      = "chore: Update CODEOWNERS [skip ci]"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            * @libp2p/js-libp2p-dev
        EOT
      + file                = "CODEOWNERS"
      + id                  = (known after apply)
      + overwrite_on_create = false
      + ref                 = (known after apply)
      + repository          = "js-libp2p-simple-metrics"
      + sha                 = (known after apply)
    }

  # github_team_repository.this["admin:js-libp2p-simple-metrics"] will be created
  + resource "github_team_repository" "this" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "admin"
      + repository = "js-libp2p-simple-metrics"
      + team_id    = "2077192"
    }

  # github_team_repository.this["w3dt-stewards:js-libp2p-simple-metrics"] will be created
  + resource "github_team_repository" "this" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "admin"
      + repository = "js-libp2p-simple-metrics"
      + team_id    = "4657013"
    }

Plan: 7 to add, 1 to change, 0 to destroy.
```

</details>
<!-- Sticky Pull Request Comment -->